#Creamos el script para la sintesis estructural mediante yosis

#Archivo principal
read_verilog Mux_Conductual_4x1_4bits.v
hierarchy -check -top Mux_Conductual_4x1_4bits

#Modulo top
proc; opt; fsm; opt; memory; opt

#Mapeando a la libreria interna
techmap; opt


#Mapeando los flip-flops
dfflibmap -liberty cmos_cells.lib

#Mapeando lalogica
abc -liberty cmos_cells.lib



clean

write_verilog Mux_Conductual_4x1_4bits_Estruc.v














