#Creamos el script para la sintesis estructural mediante yosis

#Archivo principal
read_verilog Demux_8x32.v
hierarchy -check -top Demux_8x32

#Modulo top
proc; opt; fsm; opt; memory; opt

#Mapeando a la libreria interna
techmap; opt


#Mapeando los flip-flops
dfflibmap -liberty cmos_cells.lib

#Mapeando lalogica
abc -liberty cmos_cells.lib



clean

write_verilog Demux_8x32_Estruc.v














