#Creamos el script para la sintesis estructural mediante yosis

#Archivo principal
read_verilog Serial_Paralelo.v
hierarchy -check -top Serial_Paralelo

#Modulo top
proc; opt; fsm; opt; memory; opt

#Mapeando a la libreria interna
techmap; opt


#Mapeando los flip-flops
dfflibmap -liberty cmos_cells.lib

#Mapeando lalogica
abc -liberty cmos_cells.lib



clean

write_verilog Serial_Paralelo_Estruc.v














